Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/include/proc/p32mz1025dar169.h
#define _SRCON1J_SR1J4_POSITION                  0x00000004
#define _SRCON1J_SR1J4_MASK                      0x00000010
#define _SRCON1J_SR1J4_LENGTH                    0x00000001

#define _SRCON1J_SR1J5_POSITION                  0x00000005
#define _SRCON1J_SR1J5_MASK                      0x00000020
#define _SRCON1J_SR1J5_LENGTH                    0x00000001

#define _SRCON1J_SR1J6_POSITION                  0x00000006
#define _SRCON1J_SR1J6_MASK                      0x00000040
#define _SRCON1J_SR1J6_LENGTH                    0x00000001

#define _SRCON1J_SR1J7_POSITION                  0x00000007
#define _SRCON1J_SR1J7_MASK                      0x00000080
#define _SRCON1J_SR1J7_LENGTH                    0x00000001

#define _SRCON1J_SR1J8_POSITION                  0x00000008
#define _SRCON1J_SR1J8_MASK                      0x00000100
#define _SRCON1J_SR1J8_LENGTH                    0x00000001

#define _SRCON1J_SR1J9_POSITION                  0x00000009
#define _SRCON1J_SR1J9_MASK                      0x00000200
#define _SRCON1J_SR1J9_LENGTH                    0x00000001

#define _SRCON1J_SR1J10_POSITION                 0x0000000A
#define _SRCON1J_SR1J10_MASK                     0x00000400
#define _SRCON1J_SR1J10_LENGTH                   0x00000001

#define _SRCON1J_SR1J11_POSITION                 0x0000000B
#define _SRCON1J_SR1J11_MASK                     0x00000800
#define _SRCON1J_SR1J11_LENGTH                   0x00000001

#define _SRCON1J_SR1J12_POSITION                 0x0000000C
#define _SRCON1J_SR1J12_MASK                     0x00001000
#define _SRCON1J_SR1J12_LENGTH                   0x00000001

#define _SRCON1J_SR1J13_POSITION                 0x0000000D
#define _SRCON1J_SR1J13_MASK                     0x00002000
#define _SRCON1J_SR1J13_LENGTH                   0x00000001

#define _SRCON1J_SR1J14_POSITION                 0x0000000E
#define _SRCON1J_SR1J14_MASK                     0x00004000
#define _SRCON1J_SR1J14_LENGTH                   0x00000001

#define _SRCON1J_SR1J15_POSITION                 0x0000000F
#define _SRCON1J_SR1J15_MASK                     0x00008000
#define _SRCON1J_SR1J15_LENGTH                   0x00000001

#define _ANSELK_ANSK1_POSITION                   0x00000001
#define _ANSELK_ANSK1_MASK                       0x00000002
#define _ANSELK_ANSK1_LENGTH                     0x00000001

#define _ANSELK_ANSK2_POSITION                   0x00000002
#define _ANSELK_ANSK2_MASK                       0x00000004
#define _ANSELK_ANSK2_LENGTH                     0x00000001

#define _ANSELK_w_POSITION                       0x00000000
#define _ANSELK_w_MASK                           0xFFFFFFFF
#define _ANSELK_w_LENGTH                         0x00000020

#define _TRISK_TRISK0_POSITION                   0x00000000
#define _TRISK_TRISK0_MASK                       0x00000001
#define _TRISK_TRISK0_LENGTH                     0x00000001

#define _TRISK_TRISK1_POSITION                   0x00000001
#define _TRISK_TRISK1_MASK                       0x00000002
#define _TRISK_TRISK1_LENGTH                     0x00000001

#define _TRISK_TRISK2_POSITION                   0x00000002
#define _TRISK_TRISK2_MASK                       0x00000004
#define _TRISK_TRISK2_LENGTH                     0x00000001

#define _TRISK_TRISK3_POSITION                   0x00000003
#define _TRISK_TRISK3_MASK                       0x00000008
#define _TRISK_TRISK3_LENGTH                     0x00000001

#define _TRISK_TRISK4_POSITION                   0x00000004
#define _TRISK_TRISK4_MASK                       0x00000010
#define _TRISK_TRISK4_LENGTH                     0x00000001

#define _TRISK_TRISK5_POSITION                   0x00000005
#define _TRISK_TRISK5_MASK                       0x00000020
#define _TRISK_TRISK5_LENGTH                     0x00000001

#define _TRISK_TRISK6_POSITION                   0x00000006
#define _TRISK_TRISK6_MASK                       0x00000040
#define _TRISK_TRISK6_LENGTH                     0x00000001

#define _TRISK_TRISK7_POSITION                   0x00000007
#define _TRISK_TRISK7_MASK                       0x00000080
#define _TRISK_TRISK7_LENGTH                     0x00000001

#define _TRISK_w_POSITION                        0x00000000
#define _TRISK_w_MASK                            0xFFFFFFFF
#define _TRISK_w_LENGTH                          0x00000020

#define _PORTK_RK0_POSITION                      0x00000000
#define _PORTK_RK0_MASK                          0x00000001
#define _PORTK_RK0_LENGTH                        0x00000001

#define _PORTK_RK1_POSITION                      0x00000001
#define _PORTK_RK1_MASK                          0x00000002
#define _PORTK_RK1_LENGTH                        0x00000001

#define _PORTK_RK2_POSITION                      0x00000002
#define _PORTK_RK2_MASK                          0x00000004
#define _PORTK_RK2_LENGTH                        0x00000001

#define _PORTK_RK3_POSITION                      0x00000003
#define _PORTK_RK3_MASK                          0x00000008
#define _PORTK_RK3_LENGTH                        0x00000001

#define _PORTK_RK4_POSITION                      0x00000004
#define _PORTK_RK4_MASK                          0x00000010
#define _PORTK_RK4_LENGTH                        0x00000001

#define _PORTK_RK5_POSITION                      0x00000005
#define _PORTK_RK5_MASK                          0x00000020
#define _PORTK_RK5_LENGTH                        0x00000001

#define _PORTK_RK6_POSITION                      0x00000006
#define _PORTK_RK6_MASK                          0x00000040
#define _PORTK_RK6_LENGTH                        0x00000001

#define _PORTK_RK7_POSITION                      0x00000007
#define _PORTK_RK7_MASK                          0x00000080
#define _PORTK_RK7_LENGTH                        0x00000001

#define _PORTK_w_POSITION                        0x00000000
#define _PORTK_w_MASK                            0xFFFFFFFF
#define _PORTK_w_LENGTH                          0x00000020

#define _LATK_LATK0_POSITION                     0x00000000
#define _LATK_LATK0_MASK                         0x00000001
#define _LATK_LATK0_LENGTH                       0x00000001

#define _LATK_LATK1_POSITION                     0x00000001
#define _LATK_LATK1_MASK                         0x00000002
#define _LATK_LATK1_LENGTH                       0x00000001

#define _LATK_LATK2_POSITION                     0x00000002
#define _LATK_LATK2_MASK                         0x00000004
#define _LATK_LATK2_LENGTH                       0x00000001

#define _LATK_LATK3_POSITION                     0x00000003
#define _LATK_LATK3_MASK                         0x00000008
#define _LATK_LATK3_LENGTH                       0x00000001

#define _LATK_LATK4_POSITION                     0x00000004
#define _LATK_LATK4_MASK                         0x00000010
#define _LATK_LATK4_LENGTH                       0x00000001

#define _LATK_LATK5_POSITION                     0x00000005
#define _LATK_LATK5_MASK                         0x00000020
#define _LATK_LATK5_LENGTH                       0x00000001

#define _LATK_LATK6_POSITION                     0x00000006
#define _LATK_LATK6_MASK                         0x00000040
#define _LATK_LATK6_LENGTH                       0x00000001

#define _LATK_LATK7_POSITION                     0x00000007
#define _LATK_LATK7_MASK                         0x00000080
#define _LATK_LATK7_LENGTH                       0x00000001

#define _LATK_w_POSITION                         0x00000000
#define _LATK_w_MASK                             0xFFFFFFFF
#define _LATK_w_LENGTH                           0x00000020

