Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/include/proc/p32mz1025dar169.h
#define _BF2DEVCFG2_FPLLICLK_POSITION            0x00000007
#define _BF2DEVCFG2_FPLLICLK_MASK                0x00000080
#define _BF2DEVCFG2_FPLLICLK_LENGTH              0x00000001

#define _BF2DEVCFG2_FPLLMULT_POSITION            0x00000008
#define _BF2DEVCFG2_FPLLMULT_MASK                0x00007F00
#define _BF2DEVCFG2_FPLLMULT_LENGTH              0x00000007

#define _BF2DEVCFG2_FPLLODIV_POSITION            0x00000010
#define _BF2DEVCFG2_FPLLODIV_MASK                0x00070000
#define _BF2DEVCFG2_FPLLODIV_LENGTH              0x00000003

#define _BF2DEVCFG2_VBATBOREN_POSITION           0x00000013
#define _BF2DEVCFG2_VBATBOREN_MASK               0x00080000
#define _BF2DEVCFG2_VBATBOREN_LENGTH             0x00000001

#define _BF2DEVCFG2_DSBOREN_POSITION             0x00000014
#define _BF2DEVCFG2_DSBOREN_MASK                 0x00100000
#define _BF2DEVCFG2_DSBOREN_LENGTH               0x00000001

#define _BF2DEVCFG2_DSWDTPS_POSITION             0x00000015
#define _BF2DEVCFG2_DSWDTPS_MASK                 0x03E00000
#define _BF2DEVCFG2_DSWDTPS_LENGTH               0x00000005

#define _BF2DEVCFG2_DSWDTOSC_POSITION            0x0000001A
#define _BF2DEVCFG2_DSWDTOSC_MASK                0x04000000
#define _BF2DEVCFG2_DSWDTOSC_LENGTH              0x00000001

#define _BF2DEVCFG2_DSWDTEN_POSITION             0x0000001B
#define _BF2DEVCFG2_DSWDTEN_MASK                 0x08000000
#define _BF2DEVCFG2_DSWDTEN_LENGTH               0x00000001

#define _BF2DEVCFG2_FDSEN_POSITION               0x0000001C
#define _BF2DEVCFG2_FDSEN_MASK                   0x10000000
#define _BF2DEVCFG2_FDSEN_LENGTH                 0x00000001

#define _BF2DEVCFG2_UPLLFSEL_POSITION            0x0000001E
#define _BF2DEVCFG2_UPLLFSEL_MASK                0x40000000
#define _BF2DEVCFG2_UPLLFSEL_LENGTH              0x00000001

#define _BF2DEVCFG2_w_POSITION                   0x00000000
#define _BF2DEVCFG2_w_MASK                       0xFFFFFFFF
#define _BF2DEVCFG2_w_LENGTH                     0x00000020

#define _BF2DEVCFG1_FNOSC_POSITION               0x00000000
#define _BF2DEVCFG1_FNOSC_MASK                   0x00000007
#define _BF2DEVCFG1_FNOSC_LENGTH                 0x00000003

#define _BF2DEVCFG1_DMTINTV_POSITION             0x00000003
#define _BF2DEVCFG1_DMTINTV_MASK                 0x00000038
#define _BF2DEVCFG1_DMTINTV_LENGTH               0x00000003

#define _BF2DEVCFG1_FSOSCEN_POSITION             0x00000006
#define _BF2DEVCFG1_FSOSCEN_MASK                 0x00000040
#define _BF2DEVCFG1_FSOSCEN_LENGTH               0x00000001

#define _BF2DEVCFG1_IESO_POSITION                0x00000007
#define _BF2DEVCFG1_IESO_MASK                    0x00000080
#define _BF2DEVCFG1_IESO_LENGTH                  0x00000001

#define _BF2DEVCFG1_POSCMOD_POSITION             0x00000008
#define _BF2DEVCFG1_POSCMOD_MASK                 0x00000300
#define _BF2DEVCFG1_POSCMOD_LENGTH               0x00000002

#define _BF2DEVCFG1_OSCIOFNC_POSITION            0x0000000A
#define _BF2DEVCFG1_OSCIOFNC_MASK                0x00000400
#define _BF2DEVCFG1_OSCIOFNC_LENGTH              0x00000001

#define _BF2DEVCFG1_FCKSM_POSITION               0x0000000E
#define _BF2DEVCFG1_FCKSM_MASK                   0x0000C000
#define _BF2DEVCFG1_FCKSM_LENGTH                 0x00000002

#define _BF2DEVCFG1_WDTPS_POSITION               0x00000010
#define _BF2DEVCFG1_WDTPS_MASK                   0x001F0000
#define _BF2DEVCFG1_WDTPS_LENGTH                 0x00000005

#define _BF2DEVCFG1_WDTSPGM_POSITION             0x00000015
#define _BF2DEVCFG1_WDTSPGM_MASK                 0x00200000
#define _BF2DEVCFG1_WDTSPGM_LENGTH               0x00000001

#define _BF2DEVCFG1_WINDIS_POSITION              0x00000016
#define _BF2DEVCFG1_WINDIS_MASK                  0x00400000
#define _BF2DEVCFG1_WINDIS_LENGTH                0x00000001

#define _BF2DEVCFG1_FWDTEN_POSITION              0x00000017
#define _BF2DEVCFG1_FWDTEN_MASK                  0x00800000
#define _BF2DEVCFG1_FWDTEN_LENGTH                0x00000001

#define _BF2DEVCFG1_FWDTWINSZ_POSITION           0x00000018
#define _BF2DEVCFG1_FWDTWINSZ_MASK               0x03000000
#define _BF2DEVCFG1_FWDTWINSZ_LENGTH             0x00000002

#define _BF2DEVCFG1_DMTCNT_POSITION              0x0000001A
#define _BF2DEVCFG1_DMTCNT_MASK                  0x7C000000
#define _BF2DEVCFG1_DMTCNT_LENGTH                0x00000005

#define _BF2DEVCFG1_FDMTEN_POSITION              0x0000001F
#define _BF2DEVCFG1_FDMTEN_MASK                  0x80000000
#define _BF2DEVCFG1_FDMTEN_LENGTH                0x00000001

#define _BF2DEVCFG1_w_POSITION                   0x00000000
#define _BF2DEVCFG1_w_MASK                       0xFFFFFFFF
#define _BF2DEVCFG1_w_LENGTH                     0x00000020

#define _BF2DEVCFG0_DEBUG_POSITION               0x00000000
#define _BF2DEVCFG0_DEBUG_MASK                   0x00000003
#define _BF2DEVCFG0_DEBUG_LENGTH                 0x00000002

#define _BF2DEVCFG0_JTAGEN_POSITION              0x00000002
#define _BF2DEVCFG0_JTAGEN_MASK                  0x00000004
#define _BF2DEVCFG0_JTAGEN_LENGTH                0x00000001

#define _BF2DEVCFG0_ICESEL_POSITION              0x00000003
#define _BF2DEVCFG0_ICESEL_MASK                  0x00000018
#define _BF2DEVCFG0_ICESEL_LENGTH                0x00000002

#define _BF2DEVCFG0_TRCEN_POSITION               0x00000005
#define _BF2DEVCFG0_TRCEN_MASK                   0x00000020
#define _BF2DEVCFG0_TRCEN_LENGTH                 0x00000001

#define _BF2DEVCFG0_BOOTISA_POSITION             0x00000006
#define _BF2DEVCFG0_BOOTISA_MASK                 0x00000040
#define _BF2DEVCFG0_BOOTISA_LENGTH               0x00000001

#define _BF2DEVCFG0_FECCCON_POSITION             0x00000008
#define _BF2DEVCFG0_FECCCON_MASK                 0x00000300
#define _BF2DEVCFG0_FECCCON_LENGTH               0x00000002

#define _BF2DEVCFG0_FSLEEP_POSITION              0x0000000A
#define _BF2DEVCFG0_FSLEEP_MASK                  0x00000400
#define _BF2DEVCFG0_FSLEEP_LENGTH                0x00000001

#define _BF2DEVCFG0_DBGPER_POSITION              0x0000000C
#define _BF2DEVCFG0_DBGPER_MASK                  0x00007000
#define _BF2DEVCFG0_DBGPER_LENGTH                0x00000003

